validation/turbulent_channel_openfoam/of_case/0.orig/nut
FoamFile { format ascii; class volScalarField; location "0"; object nut; }
dimensions [0 2 -1 0 0 0 0];
internalField uniform 0;
boundaryField
{
    bottomWall { type nutLowReWallFunction; value uniform 0; }
    topWall    { type nutLowReWallFunction; value uniform 0; }
    inlet      { type cyclic; }
    outlet     { type cyclic; }
    frontAndBack { type empty; }
}
