validation/turbulent_channel_openfoam/of_case/constant/momentumTransport
FoamFile { format ascii; class dictionary; location "constant"; object momentumTransport; }
simulationType RAS;
RAS
{
    model       kOmegaSST;
    turbulence  on;
    printCoeffs on;
}
