validation/turbulent_channel_openfoam/of_case/constant/physicalProperties
FoamFile { format ascii; class dictionary; location "constant"; object physicalProperties; }
viscosityModel constant;
nu  [0 2 -1 0 0 0 0] 2e-05;
