validation/turbulent_channel_openfoam/of_case/system/fvConstraints
FoamFile { format ascii; class dictionary; location "system"; object fvConstraints; }
momentumForce
{
    type        meanVelocityForce;
    cellZone    all;
    Ubar        (0.1335 0 0);
}
